var provice = [
    {
        name: "北京市",
        city: [
            {
                name: "北京市",
                county: ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县", "延庆镇"]
            }
        ]
    },
    
    
    {
        name: "河北省",
        city: [
            {
                name: "石家庄市",
                county: ["长安区", "桥东区", "桥西区", "新华区", "裕华区", "井陉矿区", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "井陉县", "微水镇", "正定县", "正定镇", "栾城县", "栾城镇", "行唐县", "龙州镇", "灵寿县", "灵寿镇", "高邑县", "高邑镇", "深泽县", "深泽镇", "赞皇县", "赞皇镇", "无极县", "无极镇", "平山县", "平山镇", "元氏县", "槐阳镇", "赵县", "赵州镇"]
            },

            {
                name: "邯郸市",
                county: ["丛台区", "邯山区", "复兴区", "峰峰矿区", "武安市", "邯郸县", "南堡乡东小屯村", "临漳县", "临漳镇", "成安县", "成安镇", "大名县", "大名镇", "涉县", "涉城镇", "磁县", "磁州镇", "肥乡县", "肥乡镇", "永年县", "临洺关镇", "邱县", "新马头镇", "鸡泽县", "鸡泽镇", "广平县", "广平镇", "馆陶县", "馆陶镇", "魏县", "魏城镇", "曲周县", "曲周镇"]
            }
        ]
    },

    {
        name:"贵州省",
        city:[
            {
                name:"贵阳市",
                county:["南明区","云岩区","花溪区","乌当区","白云区","观山湖区"]
            },

            {
                name:"遵义市",
                county:["汇川区","红花岗区","播州区","桐梓县","正安县","务川县"]
            },

            {
                name:"安顺市",
                county:["西秀区","平坝区","镇宁县","普定县","关岭县","紫云县"]
            }
        ]
    },

    {
        name:"广东省",
        city:[
            {
                name:"广州市",
                county:["东北区","越秀区","海珠区","天河区","花都区","从化区","芳村区","白云区","黄埔区","番禺区"]
            },

            {
                name:"深圳市",
                county:["罗湖区","盐田区","龙岗区","宝安区","福田区","南山区"]
            },

            {
                name:"珠海市",
                county:["金湾区","斗门区","香洲区"]
            }
        ]
    },
]